opponents = {"Фрэнк Биела на своей Audi R8": "Audi R8", "и Доминик Дапай на Dodge Viper GTS-R": "Dodge Viper GTS-R"}
completed_tasks = set()

levels = {
    1: ("Узнать предысторию", "Пропустить предысторию"),
    2: ("Ехать со средней скоростью без риска", "Ехать на высокой скорости с небольшим риском",
        "Ехать на максимальной скорости с высоким риском"),
    3: ("Рисковать и ехать на высокой скорости", "Не рисковать и сбавить скорость"),
    4: ("Ехать на максимальной скорости", "Сбавить скорость"),
    5: ("Дать комментарий прессе", "Отказаться от комментариев", "Написать свой комментарий"),
    6: ("Согласиться", "Отказаться"),
    7: ("Да", "Нет")
}


def get_player_choice(choices):
    for idx, choice in enumerate(choices, 1):
        print(f"{idx}. {choice}")
    while True:
        try:
            selection = int(input("Ваш выбор: "))
            if 1 <= selection <= len(choices):
                return selection
            else:
                print("Пожалуйста, выберите корректное число")
        except ValueError:
            print("Введите число.")


def level_1():
    print("Уровень 1. Предыстория.")
    choice = get_player_choice(levels[1])
    if choice == 1:

        print("Предыстория")
        print("")
        print("Глава 1. Аннотация")
        print("В мире автоспорта, где скорость и техника сливаются в единое целое, имя Яна Штайнера стало олицетворением совершенства за рулём автомобиля Porsche.")
        print("С 1981 по 2000 годы он заслужил статус легенды, чья карьера была насыщена невероятными победами и осталась яркой страницей в истории автоспорта.")
        print("Ян был не просто гонщиком — он был художником скорости, искусно проводя свои болиды на поворотах с точностью до миллиметра, словно рисовал шедевр на трассе.")
        print("")
        print("Глава 2. Начало")
        print("Штайнер родился в 1963 году в маленьком городке в Германии, где машины были частью его жизни с самого детства. Ведь его отец, механик, любивший автомобили,")
        print("передал сыну любовь к автомобилям. В 18 лет Яну Штайнеру посчастливилось попасть на гоночную трассу и сесть за руль гоночного Porsche 935.")
        print("Показав своё мастерство на трассе, он сразу привлёк к себе внимание специалистов, набиравших молодые таланты в автоклубы.")
        print("Благодаря своей смелости и умению находить баланс между скоростью и управлением Ян Штайнер заинтересовал команду Porsche.")
        print("Первым его успехом стал победный сезон в молодёжных сериях Германии, после чего команда Porsche пригласила его на более серьёзные международные гонки.")
        print("После своей первой победы Штайнер заявил прессе: «Моя цель – уйти непобеждённым!».")
        print("")
        print("Глава 3. Лучшие годы и покорение 24 Hours of le Mans")
        print("В 1985 году Штайнер дебютировал в гонке 24 часа Ле-Мана на Porsche 956, сразу завоевав второе место. Но это было только начало.")
        print("В 1988 году Ян Штайнер завоевал свой первый триумф на Ле-Мане, победив на Porsche 962C. Этот успех закрепил его статус лучшего гонщика своего поколения.")
        print("Он сочетал в себе 2 главных качества необходимых автогонщику: выносливость и острое тактическое чутьё.")
        print("Именно эти качества Яна Штайнера позволили команде Porsche достичь невероятных результатов.")
        print("На Porsche 962C Ян выиграл три гонки Ле-Мана подряд: в 1988, 1989 и 1990 годах, что сделало его неоспоримым лидером в мире автогонок на выносливость.")
        print("Также Штайнер в начале 90-х завоевал несколько титулов в IMSA GT Championship, выступая на легендарных Porsche 911 и 935.")
        print("Его техническое понимание машины и чувство времени позволили ему выжать максимум из каждого болида.")
        print("Он стал настоящим мастером управления на высокоскоростных болидах довольно легко балансируя между риском и контролем.")
        print("")
        print("Глава 4. Последний заезд")
        print("В 2000 году Ян Штайнер принял решение завершить свою карьеру после одной последней гонки, которая должна была стать его прощальным аккордом — 24 часа Ле-Мана.")
        print("На этот раз он собирался участвовать за рулем новейшего прототипа Porsche 911 GT1, который был разработан специально для участия в 24 часа Ле-Мана.")
        print("")
    else:
        print("Пропустить предысторию.")
        print("")
    level_2()


def level_2():
    print("Уровень 2. Начало гонки. Гонка начинается под палящим солнцем. Porsche Штайнера после итога жеребьёвки стартует с 11-й позиции.")
    choice = get_player_choice(levels[2])
    if choice == 1:
        print("Штайнер вырвается на 6-ю позицию.")
        print("")
    elif choice == 2:
        print("Штайнер вырвается на 5-ю позицию.")
        print("")
    else:
        print("Штайнер вырвается на 4-ю позицию.")
        print("")
    level_3()


def level_3():
    print("Уровень 3. Середина гонки. Частые повороты.")
    choice = get_player_choice(levels[3])
    if choice == 1:
        print("Штайнер вырывается на 3-ю позицию с небольшим износом шин.")
        print("")
        completed_tasks.add("рискованная езда")
    else:
        print("Штайнер вырывается на 3-ю позицию.")
        print("")
    level_4()


def level_4():
    print("Уровень 4. Финальный круг. Дождь заливает трассу. Есть большой риск заноса автомобиля.")
    print(f"Впереди вас два соперника: {' '.join(opponents.keys())}.")
    choice = get_player_choice(levels[4])
    if choice == 1:
        print("Штайнер едет на максимальной скорости, обходя двух соперников сбавивших скорость из-за дождя. Обогнав своих соперников Ян Штайнер финиширует первым!")
        print("")
    else:
        print("Штайнер начинает сбавлять скорость и финиширует третьим.")
        print("")
    level_5()


def level_5():
    print("Уровень 5. Комментарии прессе.")
    if "рискованная езда" in completed_tasks:
        print("Вы победили и заняли первое место. Не могли бы вы дать комментарий своим фанатам?")
        print("")
    else:
        print("Вы заняли третье место. Хотите дать комментарий зрителям?")
        print("")

    choice = get_player_choice(levels[5])
    if choice == 1:
        if "рискованная езда" in completed_tasks:
            print("Ян Штайнер: «Это был мой последний заезд. На протяжении своей карьеры в автоспорте я говорил что моей целью является уйти непобеждённым, что у меня и получилось.")
            print("Я решил завершить свою карьеру в автогонщика.»")
            print("")
        else:
            print("Ян Штайнер: «Я планировал взять первое, не получилось, не фартануло.»")
            print("")
    if choice == 2:
        print("Ян Штайнер отказался давать комментарий и завершил карьеру.")
        print("")
    if choice == 3:
        custom_comment = input("Введите ваш комментарий для прессы: ")
        print(f"Вы говорите: «{custom_comment}. Такжея бы хотел объявить о завершении своей карьеры в автогонщика.»")
    level_6()


def level_6():
    print("Уровень 6. Финальный выбор.")
    print("Руководство Porsche предлагает Яну Штайнеру стать тренером-консультантом.")
    choice = get_player_choice(levels[6])
    if choice == 1:
        print("Штайнер становится тренером-консультантом команды Porsche.")
        print("")
    else:
        print("Ян посвящает всё свободное время семье и самому себе.")
        print("")
    level_7()


def level_7():
    print("Прощание. Прочесть слова Автора?")
    choice = get_player_choice(levels[7])
    if choice == 1:
        if "рискованная езда" in completed_tasks:
            print("Эта победа стала не только очередной строкой в списке его достижений, но и конечной точкой в его великой карьере.")
            print("Ян Штайнер покинул подиум с поднятой головой, завершив свою карьеру лучшим образом, как это делают истинные чемпионы.")
            print("Он всегда говорил, что его цель — уйти непобеждённым, и этот триумф стал воплощением этой цели.")
            print("Имя Яна Штайнера навсегда осталось в сердцах поклонников автоспорта.")
            print("В истории Porsche имя Яна Штайнера — это имя великого автогонщика своего времени и мастера своего дела.")
            print("«Последний заезд» Яна Штайнера стал настоящей легендой, о которой до сих пор вспоминают как о примере абсолютного мастерства за рулём Porsche.")
            print("")
        else:
            print("Ян Штайнер покинул подиум с слегка опущенной головой, завершив свою карьеру истинным автогонщиком, хоть и заняв третье место.")
            print("Он всегда говорил, что его цель — уйти непобеждённым.")
            print("Имя Яна Штайнера навсегда осталось в сердцах поклонников автоспорта.")
            print("В истории Porsche его имя — это имя великого автогонщика своего времени и мастера своего дела.")
            print("«Последний заезд» Яна Штайнера стал настоящей легендой, о которой до сих пор вспоминают как о примере абсолютного мастерства за рулём Porsche.")
            print("")
    if choice == 2:
        print("Игра окончена.")


def start_game():
    print("Последний заезд Яна Штайнера")
    print("")
    level_1()

start_game()